Revit 2027 API
BuiltInFailures.FamilyFailures.UnableGenerateTrussByFamilyAndOrientation Property
 Revit is unable to generate a truss using the current Layout Family and Truss orientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableGenerateTrussByFamilyAndOrientation { get; }
Public Shared ReadOnly Property UnableGenerateTrussByFamilyAndOrientation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableGenerateTrussByFamilyAndOrientation {
	FailureDefinitionId^ get ();
}
static member UnableGenerateTrussByFamilyAndOrientation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace